#ifndef __BASE_STRUCTURES_H__
#define __BASE_STRUCTURES_H__

#include <Windows.h>
#include <time.h>

typedef struct
{
	INT16 Size; // 0 - 1

	INT8 Key; // 2
	INT8 CheckSum;//3

	INT16 PacketId; //4 - 5
	INT16 ClientId;

	UINT32 TimeStamp;
} PacketHeader;

typedef struct
{
	INT16 X;
	INT16 Y;
} st_Position;

struct st_Item
{
	INT16 Index;

	struct
	{
		UINT8 Index;
		UINT8 Value;
	} Effect[3];
};

#define EF1 Effect[0].Index
#define EFV1 Effect[0].Value
#define EF2 Effect[1].Index
#define EFV2 Effect[1].Value
#define EF3 Effect[2].Index
#define EFV3 Effect[2].Value

typedef struct
{
	INT16 Level;   //36-37 64-65
	INT16 Defense; //38-39 66-67
	INT16 Attack;  //40-41 68-69

    struct
    {
        UINT8 Merchant : 4;
        UINT8 Direction : 4;
    } Merchant;    //42 70

    struct 
	{
		BYTE Speed : 4;
		BYTE ChaosRate : 4;
	} Move;        //43 71 
	      
	UINT16 maxHP, //44-45 72-73
		   maxMP; //46-47 74-75

	UINT16 curHP, //48-49 76-77
		   curMP; //50-51 78-79

	INT16 STR, //52-53 80-81
		  INT, //54-55 82-83
	      DEX, //56-57 84-85 
	      CON; //58-59 86-87

	UINT8 Mastery[4]; //60-63 88-91
} st_Status;

struct stAffects
{
	UINT16 Index;
    UINT16 Master;
    UINT16 Value;
    UINT16 Time;
};

typedef struct
{
	char Name[16];
    char CapeInfo;

	struct
    {
        UINT8 Merchant : 6;
        UINT8 CityID : 2;
    } Info;

    UINT16 GuildIndex;
    UINT8 ClassInfo;

    union
    {
        struct
        {
            UINT8 SlowMov : 1;
            UINT8 DrainHP : 1;
            UINT8 VisionDrop : 1;
            UINT8 Evasion : 1;
            UINT8 Snoop : 1;
            UINT8 SpeedMov : 1;
            UINT8 SkillDelay : 1;
            UINT8 Resist : 1;
        };

        UINT8 Value;
    } AffectInfo;

    UINT16 QuestInfo;
    INT32 Gold;
    UINT32 Exp;

    st_Position LastPosition;

    st_Status bStatus;
	st_Status Status;

    st_Item Equip[16];
	st_Item Inventory[64];

    UINT32 Learn;

    UINT16 StatusPoint,
		 MasterPoint,
		 SkillPoint;

	UINT8 Critical;
    UINT8 SaveMana;

    INT8 SkillBar[4];

    INT8 GuildMemberType;

    UINT8 MagicIncrement;
    UINT8 RegenHP,
		  RegenMP;

	INT8 Resist1,
		 Resist2,
		 Resist3,
		 Resist4;

	stAffects Affects[4];	

	UINT32 Mode;                                               // 788 a 791
	UINT32 Leader;                                             // 792 a 795
	UINT32 Formation;                                  // 796 a 799
	UINT32 RouteType;                                  // 800 a 803

	UINT32 LastX;                                              // 804 a 807
	UINT32 LastY;                                              // 808 a 811
	UINT32 LastTime;                                   // 812 a 815
	UINT32 LastSpeed;                                  // 816 a 819

	UINT32 TargetX;                                    // 820 a 823
	UINT32 TargetY;                                    // 824 a 827

	UINT32 NextX;                                              // 828 a 831
	UINT32 NextY;                                              // 832 a 835
	UINT32 NextAction;                                 // 836 a 839

	UINT8 Route[24];                                 // 840 a 863

	UINT32 WaitSec;                                    // 864 a 867

	UINT32 PosX;                                               // 868 a 871
	UINT32 PosY;                                        // 872 a 875
 
	UINT32 Segment;                                    // 876 a 879
	UINT32 DeltaExp;									//880 a 883 
	UINT32 SegmentX;                                   // 884 a 887
	UINT32 SegmentY;                                   // 888 a 891
	UINT32 SegmentListX[5];                    // 892 a 911
	UINT32 SegmentListY[5];                    // 912 a 931
	UINT32 SegmentWait[5];                             // 932 a 951
	UINT32 SegmentDirection;                   // 952 a 955
	UINT32 SegmentProgress;                    // 956 a 959
 
	UINT32 GenerateIndex;                              // 960 a 963
	UINT16 CurrentTarget;                    // 964 a 965
	UINT16 EnemyList[4];                             // 966 a 973
	INT16 PartyList[12];                    // 974 a 997
 
	UINT16 Unk1;                                             // 998 a 999
 
	UINT32 WeaponDamage;                               // 1000 a 1003
	UINT32 Summoner;                                   // 1004 a 1007
	UINT32 PotionCount;                                // 1008 a 1011
	INT32 Parry;                                       // 1012 a 1015
	UINT32 GuildDisable;                               // 1016 a 1019
	UINT32 DropBonus;                                  // 1020 a 1023 //Diamante
	UINT32 ExpBonus;                                   // 1024 a 1027 //Coral
	UINT32 ForceDamage;                                // 1028 a 1031 //Esmeralda
	UINT32 ReflectDamage;                              // 1032 a 1035 //Garnet
 
	UINT32 Unk2;	
} st_Mob;

typedef struct
{
    int SkillPoint;
    int TargetType;
    int ManaSpent;
    int Delay;
    int Range;
    int InstanceType;
    int InstanceValue;
    int TickType;
    int TickValue;
    int AffectType;
    int AffectValue;
    int AffectTime;
    char Act_1[8];
    //char Act_2[8]; - só p/ 7xx
    int InstanceAttribute;
    int TickAttribute;
    int Aggressive;
    int Maxtarget;
    int PartyCheck;
    int AffectResist;
    int Passive_Check;
} st_AffectData;

typedef struct
{
	DWORD AtaqFisico;
	DWORD AtaqMagico;
	DWORD Evasao;
	DWORD Resistencia;
	DWORD VelocidadeMov;
} st_MountData;

struct sTransBonus
{
	INT32 MinDamage;
	INT32 MaxDamage;
	INT32 MinDefense;
	INT32 MaxDefense;
	INT32 MinHP;
	INT32 MaxHP;
	INT32 Unk1[2];
	INT32 SpeedAttack;
	INT32 SpeedMove;
	INT32 Unk2[6];
	INT32 Sanc;	
} st_TransBonus;

typedef struct
{
	//# Index,Name,Mesh-Texture,REQ_SIDC,Unique,EF_PRICE,EF_POS,Extreme,Grade,N0,V0,N1,V1,N2,V2,N3,V3,N4,V4,N5,V5,N6,V6,N7,V7,N8,V8,N9,V9,N10,V10,N11,V11//
	//"%d,%64s,%d.%d,%d.%d.%d.%d.%d,%d,%d,%d,%d,%d,
	//"%d,%64s,%d.%d,%d.%d.%d.%d.%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d"
    char Name[64];
	
    short mesh1;
	short mesh2;

	short unknow;

    short Level;
    short STR;
    short INT;
    short DEX;
    short CON;

    struct {
        short index;
        short value;
    } Effect[12];

    int Price;
    short Unique;
    WORD Pos;

    short Extreme;
    short Grade;
} st_ItemList;

typedef struct
{
	char Name[27];

	short Mesh1;
	short Mesh2;

	short Unknow;

	struct
	{
		short Level;
		short Str;
		short Int;
		short Dex;
		short Con;
	} REQ_SIDC;

	struct {
        short Index;
        short Value;
    } Effect[12];

	int Price;
    short Unique;
    WORD Pos;

    short Extreme;
    short Grade;
} st_ItemListCSV;

struct p334{
    PacketHeader Header;
    char Cmd[16];
    char Arg[96];
};

struct Donate
{
	st_Item Item;
	UINT8 Price;
	UINT16 Store;
};

struct Quests
{
	UINT8 CidID[40];
};

struct Pesas
{
	UINT8 Groups;
	INT16 CIDS[3][13];
	UINT8 NpcsAlive;
	bool Status;
	INT16 TimeLeft;
};

struct Room
{
	bool isActive;

	UINT8 MobsLeft;
	INT16 Cids[13];
	INT16 Leaders;

	UINT8 TimeLeft;
};

struct Aguas
{
	Room Rooms[9];
};

struct Resets
{
	UINT8 Time;
	st_Position MinCoords,
		        MaxCoords;
    UINT16 MinLevel,
		   MaxLevel;
};

struct p376
{
    PacketHeader Header;
    BYTE DstType;
    BYTE DstSlot;
    BYTE SrcType;
    BYTE SrcSlot;
    int Unknown;
};

struct DropEvent
{
	bool isOn;

	UINT8 Rate;
	WORD Id;

	UINT32 Quantity;
	UINT32 Dropped;
};

struct Messages
{
	UINT8 Time;
	char Msg[108];
};

struct st_CharList
{
	st_Position Position[4]; // 0
	char Name[4][16]; // 16
	st_Status Status[4]; // 80
	st_Item Equip[4][16]; // 192

	INT16 GuildId[4]; // 704
	INT32 Gold[4]; // 712
	INT32 Experience[4]; //728
}; // 744

struct st_Socket
{
	INT32 FD; // 0-32
	INT8* SendBuffer; // 4-36
	INT8* RecvBuffer; // 8-40
	
	INT32 SizeOfSend; // 12-44
	INT32 SizeOfRecv; // 16-48
		
	INT32 IndexOfRecv; // 20-52
	INT32 IndexOfSend; // 24-56
		
	INT32 Hello; // 28-60
}; // 32 - 64
struct CUser
{
	char Username[16]; // 0
	INT32 CharPosition; //16
	IN_ADDR In_Addr; // 20
	//inet_n2a(user->In_Addr);
	INT32 Status; // 24
	INT32 IsAutoTrading; // 28
 
	st_Socket Service; // 32
 
	INT8 Unknown_64[404]; //64
 
	struct
	{
		st_Item Item[128]; // 468
		INT32 Gold; // 1492
	} Storage;
 
	INT16 AttackCount; // 1496
	INT16 Unknown_1498; // 1498
 
	struct
	{
		PacketHeader Header; // 1500
 
		st_Item Item[8]; // 1512
		INT8 Slots[8]; // 1576
  
		INT32 Gold; // 1584
  
		bool Accept; // 1588;
  
		INT8 Unknown_1589; // 1589
  
		INT16 OtherClientId; // 1590
	} Trade;
 
	struct
	{
		PacketHeader Header; // 1592
 
		char Name[24]; // 1604
  
		st_Item Item[12]; // 1628
		INT8 Slots[12]; // 1724
  
		INT32 Price[12]; // 1736
  
		INT16 Unknown_1784; // 1784
  
		INT16 Index; // 1786
	} AutoTrade;
 
	struct
	{
		INT32 LastType; // 1788
 
		INT32 TimeStamp; // 1792
	} Attack;
 
	INT32 Unknown_1796; // 1796
 
	struct
	{
		INT32 PacketId; // 1800
		INT32 TimeStamp; // 1804
	} Movement;
 
	INT32 IllusionTime; //1808
 
	UINT32 CrackErrorCount; // 1812
 
	INT32 Billing; // 1816
 
	st_CharList CharList; //1820
 
	char LastWhisper[16]; // 2564
 
	INT32 IsBillConnect; // 2580
	char UserStatus[4]; // 2584
  
	struct
	{
		PacketHeader Header;
   
		INT32 nCommand;
		INT32 nDummy[4];
	} Session;
 
	INT8 SkillBar[8]; //2620
 
	INT32 nTargetX; // 2628
	INT32 nTargetY; // 2632
 
	struct
	{
		INT32 Whisper; // 2636
		INT32 Guild; // 2640
		INT32 Party; // 2644
		INT32 Chat; // 2648
  
		INT8 AutoTradeName[24]; // 2652
 
		INT32 PK; // 2676
	} AllStatus;
 
	struct
	{
		UINT32 CountHp; // 2680
		UINT32 CountMp; // 2684
  
		INT32 bQuaff; // 2688;
	} Potion;
 
	INT32 AdapterKeys[4]; // 2692
 
	struct
	{
		INT32 Mode; // 2708
		INT32 Index; // 2712
  
		INT32 ClassId; // 2716 - confirmar.
	} Challenger;
 
	INT32 LastReceiveTime; // 2720
	INT32 Admin; // 2724
 
	INT32 Child; // 2728
	INT32 CheckBillingTime; // 2732
	INT32 CharLoginTime; // 2736
 
	INT32 Range; // 2740
 
	INT8 Unknown_2744[404]; // 2744
}; // 3148

struct p36b // Request Refresh Itens 754
{
    PacketHeader Header;
    WORD ItemEff[16];
    BYTE pAnctCode[16];
};
 
struct p36b_613 // Request Refresh Itens 613
{
    PacketHeader Header;
    WORD ItemEff[16];  
};

typedef struct
{
    bool isTrading;
    bool WaitingData;
    bool Confirm;
 
    DWORD Gold;
    clock_t Timer;
       
    WORD ClientID;
 
    st_Item Itens[15];
    char TradeItemSlot[15];
} st_Trade;

typedef struct
{
    PacketHeader Header;
 
    st_Item TradeItem[15];
    char TradeItemSlot[15];
 
    BYTE Unknow;
 
    DWORD Gold;
    bool Confirma;
    WORD OtherClientid;
} SendTrade;

struct stTime
{
	UINT8 Dia,
		  Mes,
		  Hor,
		  Min,
		  Seg;
	UINT16 Ano;
};

struct WarInfos
{
	// Guerras cidades (Armia, Erion, Azran, Gelo, Noatum)
	UINT8  Tax[5];     // Taxa dos impostos por cidade
	UINT8  Kingdom[5]; // Reino da guild vencedora, para comparações do dragão.

	INT8  TeamCount[4][2]; // Número de jogadores em cada time na war

	INT16 OwnerTeam[4][26], // ClientId dos jogadores defensores na war
		  DefyTeam[4][26];  // ClientId dos jogadores desafiadores na war

	UINT16 Owner[5];    // GuildID dominante
	UINT16 BetIndex[4][2]; // Index da guild com maior aposta
	UINT16 WarIndexs[4][2]; // Defensora/desafiante

	UINT32 BetValue[4]; // Valor total das apostas  em fame
	
	UINT64 CityTaxs[5]; // Soma total dos impostos

	char   DraggonOwner[16]; // Caso alguém possua tudo, ganha o dragao
	char   Coroado[16];   // Dono da coroa, aquele quem conquistou Noatum

	bool   Iniciada[5],   // Se a guerra começou
		   Finalizada[5], // Se terminou
		   Delivered[5];  // Prêmio foi entregue ?

	// Guerra Noatum
	UINT8  ThorTime; // Tempo no Altar
	char   ChallengerName[16]; // Nome de quem está tentando dominar o altar
	bool   HasWinner;

	// RvR
	UINT8  Winner,
		   BonusExp;
	UINT16 RedKills,
		   BlueKills;

	bool   InitializeWar,
		   FinalizedWar,
		   MsgSended;
};

typedef struct 
{
	// Este é um exemplo de quests
	// Como o valor é UINT64, são 64 bits, ou seja, 64 quests

	// Level feito o celestial
	UINT64 Level355 : 1;
	UINT64 Level370 : 1;
	UINT64 Level380 : 1;
	UINT64 Level398 : 1;
	UINT64 Level399 : 1;

	// Cristais Arch
	UINT64 CristalElime : 1;
	UINT64 CristalSylphed : 1;
	UINT64 CristalThelion : 1;
	UINT64 CristalNoas : 1;

	// Selo do Guerreiro
	UINT64 SeloArch355 : 1;

	// Arcana
	UINT64 Arcana : 1;

	// Adicionais SubCele
	UINT64 Add120 : 1;
	UINT64 Add151 : 1;
	UINT64 Add180 : 1;
	UINT64 Add199 : 1;

	// Resets Subcelestial
	UINT64 Reset_1 : 1;
	UINT64 Reset_2 : 1;
	UINT64 Reset_3 : 1;
	UINT64 Reset_4 : 1;

	// Treinadores
	UINT64 Treinador_1 : 1;
	UINT64 Treinador_2 : 1;
	UINT64 Treinador_3 : 1;

	UINT64 Unicornio : 1;
	UINT64 MolarGargula : 1;

	UINT64 Block40Cele : 1,
           Block90Cele : 1,
           Block355Arch : 1, 
		   Block370Arch : 1;
  
	UINT64 SubCeleMade : 1;

	UINT64 Unknow : 6;

	bool ItensReceived[23];
} pQuestInfo;

struct p20D{
	PacketHeader Header; // 0 - 11

	char Login[16]; // 12 - 27
	char Password[12]; // 28 - 39

	INT32 Version; // 40 - 43
	INT32 Unknows; // 44- 47

	char Keys[16]; // 48 - 63
	char IPAddress[16]; // 64 - 79
};

struct p277
{
   PacketHeader Header;
   short Mode;
   short Info;
   int unk;
};

struct stBuffer{
        stAffects Affects[16];
        UINT8 Unknown[912];
};

struct stTarget
{
	UINT16 Index;
	UINT16 Damage;
};

typedef struct
{
    PacketHeader Header;
	UINT16 m_ClientId;
	UINT16 m_AttackCount;

	st_Position m_AttackerPosition;
	st_Position m_AffectedPosition;

	UINT16 m_SkillId;
	UINT16 m_CurrentMp;

	UINT8 m_Motion;
	UINT8 m_SkillParam;
	UINT8 m_FlagLocal;
	UINT8 m_Critical;

	UINT32 m_Hold;
	UINT32 m_CurrentExp;

	UINT16 m_ReqMp;
	UINT16 Unknown_42;

	stTarget m_Target;
} p39D_754;

typedef struct { 
	char Name[16];	 // 0 a 15 
	char CapeInfo;	 // 16 
	char Merchant;	 // 17 
	unsigned short GuildIndex;	 // 18 a 19 
	unsigned char ClassInfo;	 // 20 
	unsigned char AffectInfo;	 // 21 
	unsigned short QuestInfo;	 // 22 a 23 
	int Gold;	 // 24 a 27 
	unsigned int Exp;	 // 28 a 31 
	st_Position LastPosition;	 // 32 a 35 
	st_Status bStatus;	 // 36 a 63 
	st_Status Status;	 // 64 a 91 
	st_Item Equip[16];	 // 92 a 219 
	st_Item Inventory[64];	// 220 a 731 
	unsigned int Learn;	 // 732 a 735 
	unsigned short StatusPoint;	 // 736 a 737 
	unsigned short MasterPoint;	 // 738 a 739 
	unsigned short SkillPoint;	 // 740 a 741 
	unsigned char Critical;	 // 742 
	unsigned char SaveMana;	 // 743 
	char SkillBar[4];	 // 744 a 747 
	char GuildMemberType;	 // 748 
	unsigned char MagicIncrement;	// 749 
	unsigned char RegenHP;	 // 750 
	unsigned char RegenMP;	 // 751 
	char Resist1;	 // 752 
	char Resist2;	 // 753 
	char Resist3;	 // 754 
	char Resist4;	 // 755 
} stMOB754;

struct NewInvent
{
	st_Item sInv1[64],
			sInv2[64];	

	bool hasBuyed;
};

typedef struct
{
    BYTE SlowMov : 1;
    BYTE DrainHP : 1;
    BYTE VisionDrop : 1;
    BYTE Evasion : 1;
    BYTE Snoop : 1;
    BYTE SpeedMov : 1;
    BYTE SkillDelay : 1;
    BYTE Resist : 1;
} Affects;

struct NewPerso
{
	UINT8 ClassInfo;

	DWORD Exp;

	DWORD Learn;

    UINT16 StatusPoint,
		 MasterPoint,
		 SkillPoint;

	st_Status Stats;

	st_Item Face,
		    Capa;

	Affects AffectInfo;

	char SkillBar1[4];
    char SkillBar2[16];

	stAffects Affects[16];
};

struct p28F
{
	PacketHeader Header;
	WORD npcid;
	int BetValue;
};

struct p3D5
{
    PacketHeader Header;
    int RecruitCid;
    int dat2;
};

struct TradeEvent
{
	st_Item RequestItem[5],
		    SendedItem[5];

	INT8 Rates;
};

struct Events
{
	DropEvent Drop;
	TradeEvent Trade[6];
};

typedef struct ServerInfos
{
	// Status do SombraNegra
	int SombraNegra : 1;

	// Tempo do servidor online
	INT8 Seconds,
		 Minuts,
		 Hours,
		 Days;

	Events Event;
};

struct GuildInfos
{
	UINT32 FAME; // Fame total da guild

	char LiderName[16]; // Nick do lider
	char GuildName[20]; // Nome da guild

	char SubLiderName[3][16]; // Nome dos Subs

	UINT8 Kingdom; // Reino da guild, para comparação na hora de recrutar e para igualar
	               // No GetCreateMob

	UINT16 GuildID, // ID da guild
		   Members; // Número total de membros

	bool Posses[5]; // Cidades que possui

	UINT64 BetValue[4]; // Valor apostado em cada cidade

	INT64 WarPoints; // Pontos na war de terça e quinta

	// Infos referentes a func de transferência de liderança da guild
	bool transfer;
	INT8 confirmTransfer;
	char NewLiderName[16];
};

struct A03
{
	PacketHeader Header;

	GuildInfos Guild;
};

struct AAA
{
	PacketHeader Header;

	INT16 Type;
};

struct wdBase
{
	// Senha numérica
	char Numerica[6],
		 Login[16];

	UINT16 Cash; // Preciso nem falar o que é...

	stTime Ban; // Se estiver banido aqui vai mostrar a data do ban

	UINT8 AcessLevel;	

	struct 
	{
		stTime Date; // Data de validade do vip
		UINT8 Type; // Tipo do vip(plus, simples...)
		UINT8 RegenTime; // Tempo restante para a regen do supportmob
	}VipInfo;

	struct
	{
		// Aqui infos de personagens individualmente, acima, infos da conta em geral
		UINT16 NTs; // Entradas pro pesa
		UINT16 RvRPoints; // Pontos para comprar entradas para o RvR e outros itens

		UINT8 SoulInfo; // Configuração da soul (for/cons etc)
		UINT8 RespectiveMortal; // Mortal que criou o char caso seja arch+

		UINT8 Cidadania;// Define a cidadania do personagem
		
		INT32 Fame; // Fama do personagem

		pQuestInfo Quests; // Infos de conclusão de quests

		NewPerso Persos[2]; // Dados do cele/sub

		NewInvent nInvent;	// Dados do segundo inventário

		char SkillBar2[16]; // Segunda skillbar

		stAffects Affect[16]; // Pra ser usado posteriormente quando o save buffs for feito	

		INT32 ExpBonus;
	} Chars[4];

	struct 
	{
		// As infos escritas aqui não serão salvas
		bool isAdmin;

		bool isMod;

		int LoggedMob;

		struct 
		{
			bool isOn;
			WORD Id[5];
		}AutoDrop;

		char SND[60],
			 Tab[25];

		int userWhisper;

		UINT8 AcessLevel;

		INT16 LastClicked;

		// Quantas vezes o o usuário errou a senha numérica
		UINT8 IncorrectNumeric;

		// Passou pela numerica
		bool canLog;

		// Bônus de mg    
		INT16 MagicIncrement;

		INT8 ChatGlobal,
			 Grito,
			 RetectItem;

		INT16 hasFailed; // Para a skill ressu

		INT16 WarRestTime; // Tempo restante para ser ressucitado

		bool cantRessurect;

		UINT16 HpExtract,
			   MpExtract;
	}Ingame;
};

#define BOSSMORTO 2
#define BOSSNASCIDO 1
#define BOSSNAONASCIDO 0

struct CartasQuest
{
	// A~M~N
	INT8 Type,
		 ActualRoom,
		 bossState;
	// 0 = Boss não nasceu
	// 1 = Boss nasceu e ainda está vivo
	// 2 = Boss morreu

	bool isOn,
		 canGo;

	INT16 cIds[13],
		  TimeLeft,
		  MobsLeft;
};

struct p18A // SendRegenHp
{
	PacketHeader Header;

	UINT16 CurHP;
	INT16 Incress;
};

struct p28B//NPC CLICK
{
	PacketHeader Header;
	WORD npcid;
	BYTE Unknow1;
	BYTE Unknow2;
	short ClickOk;
};

struct DownPC
{
	PacketHeader Header;

	int Mode;
};

struct p802
{
	PacketHeader Header; // Offset 00
	int PosID; // Offset 12
	char NewCharName[16]; // Offset 16
	int ClassID; // Offset 32
};

struct p3B4 
{
    PacketHeader Header;
    BYTE Position;
};

struct p2E1h
{
	PacketHeader Header; // 0 - 11
	st_Item Item[3];//12 - 35
	UINT8 unk[40];// 36 - 75
	UINT8 Slot[3];
};

struct p373
{
	PacketHeader Header;
	DWORD SrcType, 
		  SrcSlot, 
		  DstType, 
		  DstSlot; 
	WORD     PosX, 
		     PosY; 
	DWORD    warp; 
};

struct pFDE{
	PacketHeader Header;
	char num[6];
	char unk[10];
	int RequestChange;
};

struct p182h
{
    PacketHeader Header;
    short invType;
    short invSlot;
    st_Item itemData;
};

struct p213 
{
	PacketHeader Header;
    int CharIndex;
    char Zero[18];
};

typedef struct 
{
	int Amount;
	int Slots[128];
	st_Item *Itens[128];
} FindAmountItem;

typedef struct 
{ 
	PacketHeader Header; 
	INT32 SlotIndex; 
	char Name[16]; 
	char Pwd[12]; 
} REQDELETECHAR; 

struct p379
{
	PacketHeader Header;
    short mobID;
    short sellSlot;
    short invSlot;
    short Unknown1;
    int Unknown2;
};

struct stAccount
{
	char Username[16]; 
	char Password[16]; 
	BYTE unk[0x10A4];
};

typedef struct
{
    PacketHeader Header;
    short npcId,
	      type;
    int sellSlot;
} p37A;

typedef struct
{
    PacketHeader Header;
    int Slot,
        mobId,
        Price,
        Tax;
    st_Item Item;
} p398;

typedef struct
{
	PacketHeader Header;

	st_Position WorldPos;

	char Name[16];
    char CapeInfo;

    struct
    {
        BYTE Merchant : 6;
        BYTE CityID : 2;
    } Info;

    WORD GuildIndex;
    BYTE ClassInfo;

	struct
    {
        BYTE SlowMov : 1;
        BYTE DrainHP : 1;
        BYTE VisionDrop : 1;
        BYTE Evasion : 1;
        BYTE Snoop : 1;
        BYTE SpeedMov : 1;
        BYTE SkillDelay : 1;
        BYTE Resist : 1;
    } AffectInfo;

    WORD QuestInfo;

    int Gold;
    int Exp;

    st_Position Last;
    st_Status bStatus;
    st_Status Status;

    st_Item Equip[16];
    st_Item Inventory[64];

    DWORD Learn;
    WORD pStatus;
    WORD pSkill;
    WORD pMaster;
    BYTE Critical;
    BYTE SaveMana;

    char SkillBar1[4];
    char GuildMemberType;

    BYTE MagicIncrement;
    BYTE RegenHP;
    BYTE RegenMP;

    BYTE Resist1, Resist2;
    BYTE Resist3, Resist4;

    short SlotIndex;
    short ClientIndex;
    short unk;

    char SkillBar2[16];
    short Evasion;
    int Hold;

    char Tab[28];
} p114;

struct stMOBGener
{
	UINT32 Mode; // 0 - 3
	UINT32 MinuteGenerate; // 4 - 7

	UINT32 MaxNumMob; // 8 - 11

	UINT32 MobCount; // 12 - 15
	
	UINT32 MinGroup; // 16 - 19
	UINT32 MaxGroup; // 20 - 23
	
	UINT32 Segment_X[5]; //24 - 43
	UINT32 Segment_Y[5]; // 44 - 63
	UINT32 StartRange; // 64 - 67
	
	UINT32 Segment1Range; // 68 - 71
	UINT32 Segment2Range; // 72 - 75
	UINT32 Segment3Range; // 76 - 79
	
	UINT32 DestRange; // 80 - 83
	
	UINT32 StartWait; // 84 - 87
	
	UINT32 Segment1Wait; // 88 - 91 ou Segment3Wait
	UINT32 Segment2Wait; // 92 - 95
	
	UINT32 Segment3Wait; // 96 - 99 // Não usado na TMsrv -> acho que é um erro, no ParseStrings ele move para o Segment1Wait o que está em Segmen3Wait e.e'

	UINT32 DestWait; // 100 - 103
	
	char SegmentAction[5][80]; // 104 - 503
	char FightAction[4][80]; // 504 - 823
	char FleeAction[4][80]; // 824 - 1143
	char DieAction[4][80]; // 1144 - 1463
	
	UINT32 Formation; // 1464 - 1467
	UINT32 RouteType; // 1468 - 1471 

	UINT32 Unknow; // 1472 - 1475 -> Ele pega o valor do MinuteGenerate (?)

	stMOB754 Leader; // 1476 - 2231	
	stMOB754 Follower; // 2232 - 2987
};

struct MSG_DBCreateArch
{
	PacketHeader Header;
	INT32 charSlot;
	stMOB754 mob;
};

struct p378
{
	PacketHeader Header;
    char SkillBar1[4];
    char SkillBar2[16];
};

struct p374
{
	PacketHeader Header;
	short InitID;
	int state;
    int height;
};

struct p366
{
    PacketHeader Header;
    short xSrc, ySrc;
    int mSpeed;
    int mType;
    short xDst, yDst;
    char mCommand[24];
};

struct pWindow
{
	PacketHeader Header;

	st_Item ItemId[7];

	UINT8 Slot[7];
};

typedef struct
{
	PacketHeader Header;

    st_Item ItemId[8];

    char Slot[8];

} st_Window;

struct pShany
{
	PacketHeader Header;

	st_Item ItemId[7];
	
	UINT8 Unk[18];

	UINT8 Slot[7];
};

struct pCL_181h // SHEPHER
{
	PacketHeader Header;

	unsigned short curHP;
	unsigned short curMP;
	unsigned short maxHP;
	unsigned short maxMP;
};

struct pCL_exitParty 
{
    PacketHeader Header;
    WORD clientId;
};

struct pD1D
{
    PacketHeader Header;
    char message[92];
